# StairsWinderpatternStairPathOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsWinderpatternStairPathOffset Property
ParameterTypeId Class See Also
---
"Inside Walk Line Offset": The offset from inside walk line to interior boundary
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsWinderpatternStairPathOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderpatternStairPathOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsWinderpatternStairPathOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace